// Покупатель выбирает товары и добавляет их в корзину.
// let selected = [
//  ['product_1', 20],
//  ['product_2', 45],
//  ['product_3', 67],
//  ['product_4', 75],
// ];
// Необходимо вычислить общую стоимость товаров и выставить покупателю счёт. Магазин у вас интернациональный и каждый клиент получает перечень выбранных товаров со всеми доступными типами валют. В первоначальном виде массива цена представлена в гривнах. На выходе необходимо предоставить пользователю таблицу с преобразованного массива вида:
// let totalPrice = [
//  ['product_1', ['rubles',1437], ['dollars', 20.06], ['euros', 18.18], ['yens', 2266.20], ['pounds', 14.15]],
//  ...
// ];
// Курс валют:
// rubles = 2,73;
// dollars = 0,036;
// euros = 0,030;
// yens = 3,80;
// pounds = 0,028;


let selected = [
	['product_1', 20],
	['product_2', 45],
	['product_3', 67],
	['product_4', 75],
  ];